package com.example.sosproject;

import java.util.ArrayList;
import java.util.Arrays;

public class Name {
    public final ArrayList<String> stationName = new ArrayList<String>(Arrays.asList(
            "지축3", "구파발", "연신내3", "불광3", "녹번",
            "홍제", "무악재", "독립문", "경복궁", "안국",
            "종로3가3", "을지로3가3", "충무로3", "동대입구", "약수",
            "금호3", "옥수3", "압구정", "신사", "잠원",
            "고속터미널3", "교대3", "남부터미널", "양재", "매봉",
            "도곡3", "대치", "학여울", "대청", "일원",
            "수서3", "가락시장3", "경찰병원", "오금3", "당고개",
            "상계", "노원", "창동4", "쌍문", "수유",
            "미아(서울사이버대학)", "미아삼거리", "길음", "성신여대입구", "한성대입구",
            "혜화", "동대문4", "동대문역사문화공원4", "충무로4", "명동",
            "회현", "서울4", "숙대입구", "삼각지4", "신용산",
            "이촌4", "동작", "총신대입구4", "사당4", "남태령"
    ));
}
