package com.example.sosproject;

public class Station {
    private String[] stations_3 = {
        "대화", "주엽", "정발산", "마두", "백석", "대곡", "화정", "원당",
        "원흥", "삼송", "지축", "구파발", "연신내", "불광", "녹번", "홍제",
        "무악재", "독립문", "경복궁", "안국", "종로3가", "을지로3가", "충무로",
        "동대입구", "약수", "금호", "옥수", "압구정", "신사", "잠원", "고속터미널",
        "교대", "남부터미널", "양재", "매봉", "도곡", "대치", "학여울", "대청",
        "일원", "수서", "가락시장", "경찰병원", "오금"
    };

    private String[] stations_4 = {
        "당고개", "상계", "노원", "창동", "쌍문", "수유", "미아", "미아사거리", "길음",
        "성신여대입구", "한성대입구", "혜화", "동대문", "동대문역사문화공원", "충무로",
        "명동", "회현", "서울역", "숙대입구", "삼각지", "신용산", "이촌", "동작", "총신대입구(이수)",
        "사당", "남태령", "선바위", "경마공원", "대공원", "과천", "정부과천청사", "인덕원",
        "평촌", "범계", "금정", "산본", "수리산", "대야미", "반원", "상록수", "한대앞",
        "중앙", "고잔", "초지", "안산", "신길온천", "정왕", "오이도"
    };

    // 없는 역일 경우 -1 반환
    public int getStationNum(String str){
        for (int i = 0; i < stations_3.length; ++i){
            if (stations_3[i].equals(str)){
                return 300 + i;
            }
        }
        for (int i = 0; i < stations_4.length; ++i){
            if (stations_4[i].equals(str)){
                return 400 + i;
            }
        }
        return -1;
    }
}
